app/controllers/statements_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "statements" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "rqweqwe"], ["body", "qweqwe"], ["article_id", 3], ["created_at", "2021-09-25 08:40:09.220826"], ["updated_at", "2021-09-25 08:40:09.220826"]]
---
    def create
        @article = Article.find(params[:article_id])
        @statement = @article.statements.create(statement_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "statements".* FROM "statements" WHERE "statements"."article_id" = ? AND "statements"."id" = ? LIMIT ?  [["article_id", 3], ["id", 2], ["LIMIT", 1]]
DELETE FROM "statements" WHERE "statements"."id" = ?  [["id", 2]]
---
      def destroy
        @article = Article.find(params[:article_id])
        @statement = @article.statements.find(params[:id])
        @statement.destroy